Тестовая_база_ERP_14/src/Documents/КонтролируемаяСделка/КонтролируемаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтролируемаяСделка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОКонтролируемойСделке</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВзаимозависимости</name>
    <type>
      <types>EnumRef.ТипыВзаимозависимости</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаСовершенаЧерезКомиссионера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссионер</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыЛизинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСделки</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредметаСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строка121СтороныВзаимозависимыПоКодексу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка122СделкаВОбластиВнешнейТорговли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка123СделкаСКонтрагентомСЛьготнымНалогообложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка124СделкаСНезависимымПосредником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка131СуммаДоходовПоСделкамПревышаетПредел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка132СделкаСПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка133СделкаСКонтрагентомНаСпецрежимах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка134СделкаСПлательщикомНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка136СделкаМорскогоМесторождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка137СделкаИнвестиционныйПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка138СделкаОсвобождениеОтНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка140СделкаНалогНаДополнительныйДоходУглеводородов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка135СделкаСРезидентомОЭЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНаименованияСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтороныСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияЦеныСделки</name>
    <type>
      <types>CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКПункту7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоходовРегулируемых</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходовРегулируемых</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредметаСделки</name>
    <type>
      <types>EnumRef.ТипыПредметовКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхожденияПредметаСделки</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСделки</name>
    <type>
      <types>EnumRef.ТипыКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСуммыСделок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторВидовЭкономическойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторОКВЭД2</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сделки</name>
    <attributes>
      <name>ДатаСовершенияСделки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУсловийПоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаОтправкиТовара</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРегионаОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГородОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаселенныйПунктОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаСовершенияСделки</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРегионаСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГородСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаселенныйПунктСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/ТипыПредметовКонтролируемыхСделок/ТипыПредметовКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПредметовКонтролируемыхСделок</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>РаботаУслуга</name>
  </enumValues>
  <enumValues>
    <name>ИнойОбъектГражданскихПрав</name>
  </enumValues>
  <enumValues>
    <name>ДолговоеОбязательство</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/КонтролируемаяСделка/Forms/Лист1Б/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеЗаполнения);
	
	ВерсияУведомления = Параметры.ВерсияУведомления;
	ТипПредметаСделки = Параметры.ТипПредметаСделки;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	Иначе
		Валюта = Параметры.Валюта;
	КонецЕсли;
	
	НастроитьЭлементыПоВерсииФормата();
	
	СписокКодовПоставки = КонтролируемыеСделкиПовтИсп.КодыУсловийПоставки();
	Элементы.КодУсловийПоставки.СписокВыбора.Очистить();
	Для Каждого Код Из СписокКодовПоставки Цикл
		НовыйКод = Элементы.КодУсловийПоставки.СписокВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйКод, Код);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если ПроверитьЗаполнение() Тогда
		Модифицированность = Ложь;
		СтруктураЗакрытия = ВернутьСтруктуруЗакрытия();
		Закрыть(СтруктураЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВернутьСтруктуруЗакрытия()
	
	Структура = Новый Структура();
	
	Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Структура.Вставить(Реквизит.Имя, ЭтаФорма[Реквизит.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыПоВерсииФормата()
	
	Элементы.ПроцентнаяСтавка.Видимость = 
		ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		И ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство;
	
	Элементы.ГруппаЦена.Видимость = 
		ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		Или ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство;
	
	Версия2018ИВыше = ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018();
	Элементы.ГородОтправкиТовара.Видимость = Не Версия2018ИВыше;
	Элементы.ГородСовершенияСделки.Видимость = Не Версия2018ИВыше;
	
	Элементы.Количество.ОграничениеТипа = ТипПоказателяКоличество(ВерсияУведомления);
	
	Элементы.Цена.ОграничениеТипа = ТипПоказателяЦена(ВерсияУведомления);
	
КонецПроцедуры

#Область ПоказателиУведомления

Функция ТипПоказателяКоличество(ВерсияУведомления)
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
	Иначе
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 5));
	КонецЕсли;
	
КонецФункции

Функция ТипПоказателяЦена(ВерсияУведомления)
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
	Иначе
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 4));
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
